In [1]:
import pandas as pd

data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

employee

    id   name department  managerId
0  101   John          A       <NA>
1  102    Dan          A        101
2  103  James          A        101
3  104    Amy          A        101
4  105   Anne          A        101
5  106    Ron          B        101

In [2]:
employee = employee.fillna(-1)
employee

    id   name department  managerId
0  101   John          A         -1
1  102    Dan          A        101
2  103  James          A        101
3  104    Amy          A        101
4  105   Anne          A        101
5  106    Ron          B        101

In [3]:
result = pd.DataFrame([], columns=['name'])
result

Empty DataFrame
Columns: [name]
Index: []

In [4]:
len(result)

0

In [5]:
for i in employee['id']:
    print(i)

101
102
103
104
105
106

In [6]:
for i in employee['id']:
    count = 0
    for j in employee['managerId']:
        if i == j:
            count += 1
        if count == 5:
            break
    if count == 5:
        result = pd.concat([result, pd.DataFrame({'name': [employee[employee['id'] == i]['name'].values[0]]})], ignore_index=True)

result

   name
0  John